---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\我的雲端硬碟\Document\111Spring\2_勞動經濟學專題\termPaper\log\b0830302
> 4_Xiang_Jyun_Jhang.log
  log type:  text
 opened on:  17 Apr 2023, 00:27:23

. 
. 
. * part 1: Read Data
. cd "$rawData"
G:\我的雲端硬碟\Document\111Spring\2_勞動經濟學專題\termPaper\rawData

. use "SH\SH_2001_A_student.dta", clear

. 
. 
. * part 2: Examine Data
. sum w1cls_pn, detail       // number of students per classroom

                  w1:母體班級總人數
-------------------------------------------------------------
      Percentiles      Smallest
 1%           20             10
 5%           30             10
10%           35             10       Obs              18,916
25%           41             10       Sum of Wgt.      18,916

50%           45                      Mean           44.69967
                        Largest       Std. Dev.      8.029693
75%           50             65
90%           54             65       Variance       64.47596
95%           57             65       Skewness      -.7679429
99%           61             65       Kurtosis       4.632826

. tab w1s208                 // Divorse Time

     w1:父母/分 |
        居/離婚 |      Freq.     Percent        Cum.
----------------+-----------------------------------
           沒有 |     16,970       89.08       89.08
       國小以前 |        666        3.50       92.57
       國小時期 |        641        3.36       95.94
       國中時期 |        399        2.09       98.03
高中職/專科時期 |        235        1.23       99.27
       不合理值 |         13        0.07       99.33
         未填答 |        127        0.67      100.00
----------------+-----------------------------------
          Total |     19,051      100.00

. inspect w1s208

w1s208:  w1:父母/分居/離婚                      Number of Observations
--------------------------             ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive       19,051        19,051             -
|  #                                   -----------   -----------   -----------
|  #                         Total          19,051        19,051             -
|  #   .   .   .   .         Missing             -
+----------------------                -----------
1                    99                     19,051
   (7 unique values)

      w1s208 is labeled and all values are documented in the label.

. duplicates report

Duplicates in terms of all variables

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |        19051             0
--------------------------------------

. duplicates report stud_id  // use student id to verify uniqueness

Duplicates in terms of stud_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |        19051             0
--------------------------------------

. 
. 
. * part 3: Create Sample For Analysis: Part 1 & Part 2
. gen divorse = 1 if (2 <= w1s208) & (w1s208 <= 5) & (w1s208 != .)
(17,110 missing values generated)

. replace divorse = 0 if (1 == w1s208 | w1s208 >= 6) & (w1s208 != .)
(17,110 real changes made)

. egen divorseRate = mean(divorse)

. label define mapping_divorse 1"divorsed" 0"not divorsed"

. labe value divorse mapping_divorse

. recode w1s208 (97/99 = .)
(w1s208: 140 changes made)

. merge 1:1 stud_id using "SH\SH_2009.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,129
        from master                     3,129  (_merge==1)
        from using                          0  (_merge==2)

    matched                            15,922  (_merge==3)
    -----------------------------------------

. 
. 
. * part 4: Visualize Data
. histogram w1s208, discrete percent width(0.5) xtitle(education period) ytitle(percent
> ) xlabel(1 2 3 4 5, valuelabel)
(start=1, width=.5)

. recode sh09v33 (9/99 = .)
(sh09v33: 5214 changes made)

. gen undergraduate = 1 if (sh09v33>=5) & (sh09v33 != .)
(9,859 missing values generated)

. replace undergraduate = 0 if (sh09v33<5) & (sh09v33 != .)
(1,516 real changes made)

. twoway (lfit undergraduate divorse)

. 
. 
. * part 5: Prelimilary Analysis
. reg undergraduate divorse, r

Linear regression                               Number of obs     =     10,708
                                                F(1, 10706)       =      11.90
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0014
                                                Root MSE          =     .34841

------------------------------------------------------------------------------
             |               Robust
undergradu~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     divorse |   -.050402   .0146102    -3.45   0.001    -.0790407   -.0217633
       _cons |   .8619962   .0034582   249.26   0.000     .8552175    .8687749
------------------------------------------------------------------------------

. 
. rename _merge merge_2009

. merge 1:1 stud_id using "SH/SH_2001_G_parent.dta"
(label w1log1 already defined)
(label w1log2 already defined)
(label w1log3 already defined)
(label w1log4 already defined)
(label w1log5 already defined)
(label w1log6 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           518
        from master                       518  (_merge==1)
        from using                          0  (_merge==2)

    matched                            18,533  (_merge==3)
    -----------------------------------------

. recode w1faedu (6/99 = .)
(w1faedu: 1019 changes made)

. recode w1moedu (6/99 = .)
(w1moedu: 642 changes made)

. gen fa_undergraduate = 1 if (w1faedu>=3) & (w1faedu<=5) & (w1faedu != .)
(14,098 missing values generated)

. replace fa_undergraduate = 0 if (w1faedu<3 | w1faedu>5) & (w1faedu != .)
(12,561 real changes made)

. gen ma_undergraduate = 1 if (w1moedu>=3) & (w1moedu<=5) & (w1moedu != .)
(16,178 missing values generated)

. replace ma_undergraduate = 0 if (w1moedu<3 | w1moedu>5) & (w1moedu != .)
(15,018 real changes made)

. reg undergraduate divorse fa_undergraduate ma_undergraduate, r

Linear regression                               Number of obs     =      9,906
                                                F(3, 9902)        =     161.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0295
                                                Root MSE          =     .33963

----------------------------------------------------------------------------------
                 |               Robust
   undergraduate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         divorse |  -.0567738   .0175152    -3.24   0.001    -.0911072   -.0224404
fa_undergraduate |   .1004801   .0069128    14.54   0.000     .0869296    .1140306
ma_undergraduate |   .0518321   .0071708     7.23   0.000     .0377758    .0658883
           _cons |   .8275158   .0046025   179.80   0.000     .8184939    .8365377
----------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  G:\我的雲端硬碟\Document\111Spring\2_勞動經濟學專題\termPaper\log\b0830302
> 4_Xiang_Jyun_Jhang.log
  log type:  text
 closed on:  17 Apr 2023, 00:27:26
---------------------------------------------------------------------------------------
